//=============================================================================
//
// ビルボード(火花)処理 [spark.h]
// Author : 倉田勇次
//
//=============================================================================
#pragma once

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SPARK_PLUS_POS_Y	(8.0f)		// 火花を出す座標設定
#define SPARK_PLUS_POS_Z	(35.0f)		// 火花を出す座標設定
#define SPARK_SCL			(0.5f)		// スケール
#define SPARK_TIME			(6)			// 火花を出す時間

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef class
{
	public:
	XMFLOAT3	pos;			// 位置
	XMFLOAT3	scl;			// スケール
	MATERIAL	material;		// マテリアル
	float		fWidth;			// 幅
	float		fHeight;		// 高さ
	int			sparkcnt;		// 出現時間
	BOOL		use;			// 使用しているかどうか

} SPARK;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSpark(void);
void UninitSpark(void);
void UpdateSpark(void);
void DrawSpark(void);
int SetSpark(XMFLOAT3 pos, float fWidth, float fHeight, XMFLOAT4 col);
SPARK* GetSpark();


